In [1]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-8.0.33-cp38-cp38-win_amd64.whl (9.6 MB)
Collecting protobuf<=3.20.3,>=3.11.0
  Downloading protobuf-3.20.3-cp38-cp38-win_amd64.whl (904 kB)
Installing collected packages: protobuf, mysql-connector-python
Successfully installed mysql-connector-python-8.0.33 protobuf-3.20.3

In [3]:
!pip install --upgrade mysql-connector

Collecting mysql-connector
  Using cached mysql-connector-2.2.9.tar.gz (11.9 MB)
Building wheels for collected packages: mysql-connector
  Building wheel for mysql-connector (setup.py): started
  Building wheel for mysql-connector (setup.py): finished with status 'done'
  Created wheel for mysql-connector: filename=mysql_connector-2.2.9-cp38-cp38-win_amd64.whl size=247943 sha256=98bfa30dff2d192a5358236659e4e867a305769bccf35121d391e22df89b37ce
  Stored in directory: c:\users\amazi\appdata\local\pip\cache\wheels\57\e4\98\5feafb5c393dd2540e44b064a6f95832990d543e5b4f53ea8f
Successfully built mysql-connector
Installing collected packages: mysql-connector
Successfully installed mysql-connector-2.2.9

In [9]:
import mysql.connector as connector

connection=connector.connect(user="root",password="zztm")

In [10]:
cursor = connection.cursor()

In [11]:
cursor.execute("CREATE DATABASE little_lemon_db")

In [12]:
cursor.execute("USE little_lemon_db")

In [13]:
#MenuItems table
create_menuitem_table = """CREATE TABLE MenuItems (
ItemID INT AUTO_INCREMENT,
Name VARCHAR(200),
Type VARCHAR(100),
Price INT,
PRIMARY KEY (ItemID)
);"""

In [14]:
create_menu_table = """CREATE TABLE Menus (
MenuID INT,
ItemID INT,
Cuisine VARCHAR(100),
PRIMARY KEY (MenuID,ItemID)
);"""

In [19]:
create_booking_table = """CREATE TABLE Bookings (
BookingID INT AUTO_INCREMENT,
TableNo INT,
GuestFirstName VARCHAR(100) NOT NULL,
GuestLastName VARCHAR(100) NOT NULL,
BookingSlot TIME NOT NULL,
EmployeeID INT,
PRIMARY KEY (BookingID)
);"""

In [16]:
create_orders_table = """CREATE TABLE Orders (
OrderID INT,
TableNo INT,
MenuID INT,
BookingID INT,
BillAmount INT,
Quantity INT,
PRIMARY KEY (OrderID,TableNo)
);"""

In [39]:
create_employees_table = """CREATE TABLE Employees (
EmployeeID INT AUTO_INCREMENT,
Name VARCHAR(100),
Role VARCHAR(100),
Address VARCHAR(100),
Contact_Number INT,
Email VARCHAR(100),
Annual_Salary VARCHAR(100),
PRIMARY KEY (EmployeeID)
);"""

In [40]:
# Create MenuItems table
# cursor.execute(create_menuitem_table)

# Create Menu table
# cursor.execute(create_menu_table)

# Create Bookings table
# cursor.execute(Create_booking_table)

# Create Orders table
# cursor.execute(create_orders_table)

# Create Employees table
cursor.execute(create_employees_table)

In [23]:
#*******************************************************#
# Insert query to populate "MenuItems" table:
#*******************************************************#
insert_menuitems="""
INSERT INTO MenuItems (ItemID, Name, Type, Price)
VALUES
(1, 'Olives','Starters',5),
(2, 'Flatbread','Starters', 5),
(3, 'Minestrone', 'Starters', 8),
(4, 'Tomato bread','Starters', 8),
(5, 'Falafel', 'Starters', 7),
(6, 'Hummus', 'Starters', 5),
(7, 'Greek salad', 'Main Courses', 15),
(8, 'Bean soup', 'Main Courses', 12),
(9, 'Pizza', 'Main Courses', 15),
(10, 'Greek yoghurt','Desserts', 7),
(11, 'Ice cream', 'Desserts', 6),
(12, 'Cheesecake', 'Desserts', 4),
(13, 'Athens White wine', 'Drinks', 25),
(14, 'Corfu Red Wine', 'Drinks', 30),
(15, 'Turkish Coffee', 'Drinks', 10),
(16, 'Turkish Coffee', 'Drinks', 10),
(17, 'Kabasa', 'Main Courses', 17);"""

#*******************************************************#
# Insert query to populate "Menu" table:
#*******************************************************#
insert_menu="""
INSERT INTO Menus (MenuID,ItemID,Cuisine)
VALUES
(1, 1, 'Greek'),
(1, 7, 'Greek'),
(1, 10, 'Greek'),
(1, 13, 'Greek'),
(2, 3, 'Italian'),
(2, 9, 'Italian'),
(2, 12, 'Italian'),
(2, 15, 'Italian'),
(3, 5, 'Turkish'),
(3, 17, 'Turkish'),
(3, 11, 'Turkish'),
(3, 16, 'Turkish');"""

#*******************************************************#
# Insert query to populate "Bookings" table:
#*******************************************************#
insert_bookings="""
INSERT INTO Bookings (BookingID, TableNo, GuestFirstName, 
GuestLastName, BookingSlot, EmployeeID)
VALUES
(1, 12, 'Anna','Iversen','19:00:00',1),
(2, 12, 'Joakim', 'Iversen', '19:00:00', 1),
(3, 19, 'Vanessa', 'McCarthy', '15:00:00', 3),
(4, 15, 'Marcos', 'Romero', '17:30:00', 4),
(5, 5, 'Hiroki', 'Yamane', '18:30:00', 2),
(6, 8, 'Diana', 'Pinto', '20:00:00', 5);"""

#*******************************************************#
# Insert query to populate "Orders" table:
#*******************************************************#
insert_orders="""
INSERT INTO Orders (OrderID, TableNo, MenuID, BookingID, Quantity, BillAmount)
VALUES
(1, 12, 1, 1, 2, 86),
(2, 19, 2, 2, 1, 37),
(3, 15, 2, 3, 1, 37),
(4, 5, 3, 4, 1, 40),
(5, 8, 1, 5, 1, 43);"""

#*******************************************************#
# Insert query to populate "Employees" table:
#*******************************************************#
# insert_employees = """
# INSERT INTO employees (EmployeeID, Name, Role, Address, Contact_Number, Email, Annual_Salary) VALUES
# (01,'Mario Gollini','Manager','724, Parsley Lane, Old Town, Chicago, IL',351258074,'Mario.g@littlelemon.com','$70,000'),
# (02,'Adrian Gollini','Assistant Manager','334, Dill Square, Lincoln Park, Chicago, IL',351474048,'Adrian.g@littlelemon.com','$65,000'),
# (03,'Giorgos Dioudis','Head Chef','879 Sage Street, West Loop, Chicago, IL',351970582,'Giorgos.d@littlelemon.com','$50,000'),
# (04,'Fatma Kaya','Assistant Chef','132  Bay Lane, Chicago, IL',351963569,'Fatma.k@littlelemon.com','$45,000'),
# (05,'Elena Salvai','Head Waiter','989 Thyme Square, EdgeWater, Chicago, IL',351074198,'Elena.s@littlelemon.com','$40,000'),
# (06,'John Millar','Receptionist','245 Dill Square, Lincoln Park, Chicago, IL',351584508,'John.m@littlelemon.com','$35,000');"""

In [43]:
insert_employees = """
INSERT INTO employees (EmployeeID, Name, Role, Address, Contact_Number, Email, Annual_Salary) VALUES
(01,'Mario Gollini','Manager','724, Parsley Lane, Old Town, Chicago, IL',351258074,'Mario.g@littlelemon.com','$70,000'),
(02,'Adrian Gollini','Assistant Manager','334, Dill Square, Lincoln Park, Chicago, IL',351474048,'Adrian.g@littlelemon.com','$65,000'),
(03,'Giorgos Dioudis','Head Chef','879 Sage Street, West Loop, Chicago, IL',351970582,'Giorgos.d@littlelemon.com','$50,000'),
(04,'Fatma Kaya','Assistant Chef','132  Bay Lane, Chicago, IL',351963569,'Fatma.k@littlelemon.com','$45,000'),
(05,'Elena Salvai','Head Waiter','989 Thyme Square, EdgeWater, Chicago, IL',351074198,'Elena.s@littlelemon.com','$40,000'),
(06,'John Millar','Receptionist','245 Dill Square, Lincoln Park, Chicago, IL',351584508,'John.m@littlelemon.com','$35,000');"""

In [44]:
# Populate MenuItems table
# cursor.execute(insert_menuitems)
# connection.commit()

# # Populate MenuItems table
# cursor.execute(insert_menu)
# connection.commit()

# # Populate Bookings table
# cursor.execute(insert_bookings)
# connection.commit()

# Populate Orders table
# cursor.execute(insert_orders)
# connection.commit()

# Populate Employees table
cursor.execute(insert_employees)
connection.commit()

In [46]:
dbconfig={"database":"little_lemon_db", "user":"root", "password":"zztm"}

In [48]:
from mysql.connector import MySQLConnection, Error, pooling
# Step 2: Create a connection pool
try:
  pool_a = pooling.MySQLConnectionPool(pool_name = "pool_a", pool_size = 2, **dbconfig)
except Error as e:
  print(f"Error while connecting to MySQL using Connection pool: {str(e)}")

In [49]:
# Step 3: Get a connection from the pool and create a cursor object
try:
  conn = pool_a.get_connection()
  cursor = conn.cursor()
except Error as e:
  print(f"Error while getting connection: {str(e)}")

In [79]:
# Creating the SQL query for the stored procedure
peakhour = """
CREATE PROCEDURE PeakHour()
BEGIN
SELECT HOUR(BookingSlot) as booking_hour, COUNT(*) as number_of_bookings
FROM Bookings
GROUP BY booking_hour
ORDER BY number_of_bookings DESC;
END
"""

In [80]:
cursor.execute(peakhour)

In [96]:
cursor.callproc('peakhour')

()

In [73]:
try:
    connection = pool_a.get_connection()
    cursor = connection.cursor()
except Error as e:
    print("Error:", e)

Error: Failed getting connection; pool exhausted

In [97]:
results = next( cursor.stored_results() )

In [98]:
dataset = results.fetchall()

In [99]:
for column_id in cursor.stored_results():
    columns = [ column[0] for column in column_id.description ]

In [100]:
print(columns)

['booking_hour', 'number_of_bookings']

In [102]:
print(columns)
for data in dataset:
    print(data)

['booking_hour', 'number_of_bookings']
(19, 2)
(15, 1)
(17, 1)
(18, 1)
(20, 1)

In [121]:
create_procedure_query = """
CREATE PROCEDURE GuestStatus_1()
BEGIN
    SELECT CONCAT(Bookings.GuestFirstName, ' ', Bookings.GuestLastName) AS guest_name,
    CASE
        WHEN employees.Role IN ('Manager', 'Assistant Manager') THEN 'Ready to pay'
        WHEN employees.Role = 'Head Chef' THEN 'Ready to serve'
        WHEN employees.Role = 'Assistant Chef' THEN 'Preparing Order'
        WHEN employees.Role = 'Head Waiter' THEN 'Order served'
    END AS order_status
    FROM bookings
    LEFT JOIN employees ON bookings.EmployeeID = employees.EmployeeID;
END
"""

In [122]:
cursor = connection.cursor()

In [123]:
cursor.execute(create_procedure_query)

In [124]:

cursor.callproc("GuestStatus_1")

()

In [125]:
results_1 = next( cursor.stored_results() )

In [126]:
dataset_1 = results_1.fetchall()

In [127]:
for column_id in cursor.stored_results():
    columns = [ column[0] for column in column_id.description ]

In [128]:
print(columns)

['guest_name', 'order_status']

In [129]:
for data in dataset_1:
    print(data)

('Anna Iversen', 'Ready to pay')
('Joakim Iversen', 'Ready to pay')
('Vanessa McCarthy', 'Ready to serve')
('Marcos Romero', 'Preparing Order')
('Hiroki Yamane', 'Ready to pay')
('Diana Pinto', 'Order served')

In [158]:
## Task 1

In [146]:

dbconfig = {
    "host": "localhost",
    "user": "root",
    "password": "zztm",
    "database": "little_lemon_db"
}

In [147]:
from mysql.connector import MySQLConnection, Error, pooling
try:
  pool_b = pooling.MySQLConnectionPool(pool_name = "pool_b", pool_size = 2, **dbconfig)
except Error as e:
  print(f"Error while connecting to MySQL using Connection pool: {str(e)}")

In [149]:
try:
  conn = pool_b.get_connection()
  cursor = conn.cursor()
except Error as e:
  print(f"Error while getting connection: {str(e)}")

In [159]:
## Task 2

In [151]:
query = "INSERT INTO Bookings (TableNo, GuestFirstName, GuestLastName, BookingSlot, EmployeeID) VALUES (8, 'Anees', 'Java', '18:00', 6)"
cursor.execute(query)

In [152]:
query = "INSERT INTO Bookings (TableNo, GuestFirstName, GuestLastName, BookingSlot, EmployeeID) VALUES (5, 'Bald', 'Vin', '19:00', 6)"
cursor.execute(query)

In [153]:
query = "INSERT INTO Bookings (TableNo, GuestFirstName, GuestLastName, BookingSlot, EmployeeID) VALUES (12, 'Jay', 'Kon', '19:30', 6)"
cursor.execute(query)

In [154]:
try:
    cursor.execute(query)
    connection.commit()
except pymysql.err.PoolError as e:
    print("PoolError:", e)

In [155]:
connection.commit()

In [157]:
## Task 3

In [160]:
connection=connector.connect(
                             user="root",
                             password="zztm",
                            )

In [161]:
cursor = connection.cursor()

In [163]:
cursor.execute("USE little_lemon_db")

In [164]:
connection.database

'little_lemon_db'

In [167]:
sql_query = """SELECT 
EmployeeID, Name
FROM employees
WHERE Role = 'Manager'
;"""
cursor.execute(sql_query)
results = cursor.fetchall()
for result in results:
    print("Manager_name: ",result[1], "EmployeeID",result[0])

Manager_name:  Mario Gollini EmployeeID 1

In [168]:
sql_query = """SELECT 
EmployeeID, Name
FROM employees
WHERE Annual_Salary = (SELECT MAX(Annual_Salary) FROM employees)
;"""
cursor.execute(sql_query)
results = cursor.fetchall()
for result in results:
    print("Employee_name: ",result[1], "EmployeeID",result[0])

Employee_name:  Mario Gollini EmployeeID 1

In [169]:
sql_query = """SELECT 
COUNT(*)
FROM Bookings
WHERE HOUR(BookingSlot) between '18:00' and '20:00'
;"""
cursor.execute(sql_query)
results = cursor.fetchall()
for result in results:
    print("Count: ",result[0])

Count:  4

In [170]:
sql_query = """SELECT 
CONCAT(Bookings.GuestFirstName, ' ', Bookings.GuestLastName) AS guest_name,
BookingID,
BookingSlot
FROM Bookings
ORDER BY BookingSlot
;"""
cursor.execute(sql_query)
results = cursor.fetchall()
for result in results:
    print("guest_name: ",result[0], 'Booking_ID',result[1], 'Booking_Slot',result[2])

guest_name:  Vanessa McCarthy Booking_ID 3 Booking_Slot 15:00:00
guest_name:  Marcos Romero Booking_ID 4 Booking_Slot 17:30:00
guest_name:  Hiroki Yamane Booking_ID 5 Booking_Slot 18:30:00
guest_name:  Anna Iversen Booking_ID 1 Booking_Slot 19:00:00
guest_name:  Joakim Iversen Booking_ID 2 Booking_Slot 19:00:00
guest_name:  Diana Pinto Booking_ID 6 Booking_Slot 20:00:00

In [171]:
# (OrderID, TableNo, MenuID, BookingID, Quantity, BillAmount)
create_procedure_query = """
CREATE PROCEDURE BasicSalesReport()
BEGIN
    SELECT 
        SUM(BillAmount) AS total_sales,
        AVG(BillAmount) AS average_sale,
        MIN(BillAmount) AS minimum_bill_paid,
        MAX(BillAmount) AS maximum_bill_paid
    FROM 
        Orders;
END
;"""

cursor.execute(create_procedure_query)
cursor.callproc("BasicSalesReport")
results = next( cursor.stored_results() )

In [172]:
dataset = results.fetchall()

In [173]:
for column_id in cursor.stored_results():
    columns = [ column[0] for column in column_id.description ]

In [174]:
print(columns)
for data in dataset:
    print(data)

['total_sales', 'average_sale', 'minimum_bill_paid', 'maximum_bill_paid']
(Decimal('243'), Decimal('48.6000'), 37, 86)

In [175]:
try:
  pool_c = pooling.MySQLConnectionPool(pool_name = "pool_c", pool_size = 3, **dbconfig)
except Error as e:
  print(f"Error while connecting to MySQL using Connection pool: {str(e)}")

In [176]:
connection1 = pool_c.get_connection()

In [178]:
cursor = connection1.cursor(buffered=True)

In [184]:
# Bookings (BookingID, TableNo, GuestFirstName, GuestLastName, BookingSlot, EmployeeID)
# employees (EmployeeID, Name, Role)
sql_query= """
SELECT
    e.name as chef_name, CONCAT(b.GuestFirstName, ' ', b.GuestLastName) AS guest_name, b.BookingSlot
FROM bookings b
    left join employees e on b.EmployeeID = e.EmployeeID
WHERE e.role Like '%Chef'
ORDER BY b.BookingSlot ASC
LIMIT 3
;"""

In [185]:
cursor.execute(sql_query)

In [186]:
results = cursor.fetchall()

In [187]:
cols = cursor.column_names

In [188]:
for result in results:
    print(result)

('Giorgos Dioudis', 'Vanessa McCarthy', datetime.timedelta(seconds=54000))
('Fatma Kaya', 'Marcos Romero', datetime.timedelta(seconds=63000))

In [189]:
connection1.close()